quantummongolia/industrial-iot/esp32_firmware/hothon/src/main.cpp
  // ---- Firebase delivery watchdog ----
  // WiFi асан, Firebase.ready()==true мөртөө бичилт сервер хүрэхгүй (token хүчинтэй ч
  // доорх TCP/TLS session үхсэн "дүлий" төлөв) бол дээрх !Firebase.ready() болзол
  // ХЭЗЭЭ Ч барихгүй. Иймд сүүлийн амжилттай Firebase контактаас MAX_OFFLINE_MS
  // хэтэрвэл цэвэр reset хийж шинээр холбогдоно.
  if (firebaseReady && WiFi.status() == WL_CONNECTED &&
      ota::lastContactMs() != 0 &&
      now - ota::lastContactMs() >= cfg::MAX_OFFLINE_MS) {
    Serial.println("[Watchdog] Firebase delivery stalled — clean restart");
    Serial.flush();
    delay(200);
    ESP.restart();
  }

  // WiFi.reconnect() / auto-reconnect зарим тохиолдолд бодит сүлжээ сэргэсэн ч
  // chip-ийн WiFi stack хатуу "stuck" болсон үед амжилтгүй хэвээр үлддэг —
  // үүнийг зөвхөн бүрэн restart л засдаг тул threshold давсан бол reboot хийнэ.
  if (wifiDisconnectedAt != 0 &&
      now - wifiDisconnectedAt >= cfg::WIFI_DISCONNECT_RESTART_MS) {
    Serial.println("[Stability] WiFi 5+ минут тасархад — restarting");
    delay(200);
    ESP.restart();
  }

  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    Serial.println("[WiFi] retry — async reconnect");
    WiFi.reconnect();
  }

  static unsigned long lastPoll = 0;
  if (now - lastPoll < cfg::POLL_MS)
    return;
  lastPoll = now;

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[WiFi] not connected");
    led::setMode(led::SLOW_RED);
    return;
  }

  // Boot үед уншиж чадаагүй CT primary-г дахин оролдоно.
  if (!ctPrimaryKnown[cfg::EM14_SLAVE]) {
    Spm33_readCtPrimary(modbus, cfg::EM14_SLAVE);
    delay(cfg::FRAME_GAP_MS);
  }

  // Цикл бүрд flow-cycle (power) эсвэл totalizer-cycle (energy) гэсэн 2 төрлийн
  // нэг нь явна. RS485 bus-н ачааллыг бууруулж, energy-г тусад нь 1 минутын циклд
  // уншина. Boot-ийн дараа нэг удаа energy-г шууд уншиж cache-г бөглөнө.
  bool totalizerCycle = (lastTotalizerReadTime == 0) ||
                        (now - lastTotalizerReadTime >= cfg::TOTALIZER_INTERVAL_MS);

  Spm33Reading em14;

  if (totalizerCycle) {
    // ── Totalizer cycle: EM14 энерги
    lastTotalizerReadTime = now;
    Serial.println("[Cycle] Totalizer read (1 min interval)");

    em14 = Spm33_readEnergy(modbus, cfg::EM14_SLAVE);
    if (em14.energyOk) { cachedEm14EnergyKWh = em14.energyKWh; cachedEm14EnergyValid = true; }

    Serial.printf("[Totalizer] EM14:%s\n",
                  em14.energyOk ? String(em14.energyKWh, 1).c_str() : "#");
  } else {
    // ── Flow cycle: EM14 power
    em14 = Spm33_readPower(modbus, cfg::EM14_SLAVE);

    Serial.printf("[Flow] EM14:%s\n",
                  em14.powerOk ? String(em14.powerKW, 2).c_str() : "#");
  }

  // ── Алдаа escalate ──────────────────────────────────────────────
  bool anyOk = em14.powerOk || em14.energyOk;
  if (anyOk) {
    consecutiveReadFails = 0;
    totalRecoveryAttempts = 0;
  } else {
    consecutiveReadFails++;
    if (consecutiveReadFails >= cfg::MAX_CONSECUTIVE_FAILS)
      recoverModbusBus();
  }

  // ── Firebase upload — /energy_meters subtree-г жижиг updateNode-оор бичнэ.
  if (!fbCanUpload()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!Firebase.ready()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!firebaseReady) {
    firebaseReady = true;
    Serial.println("[Firebase] ready");
    ota::begin(&fbData);  // DEVICE_ID register + командын stream нээх
  }

  // ─ /energy_meters/em14 ─────────────────────────────────────────────
  // Flow cycle: power_kw (instantaneous)
  // Totalizer cycle: total_energy_kwh (cumulative)
  bool emOk = true;
  bool emAny = false;
  {
    FirebaseJson j;
    auto addEm = [&](const char *id, const Spm33Reading &r, LiveState &lv) {
      String base = String(id) + "/";
      if (totalizerCycle) {
        if (r.energyOk) {
          j.set((base + "total_energy_kwh").c_str(), r.energyKWh);
          emAny = true;
        }
      } else {
        if (r.powerOk) {
          j.set((base + "power_kw").c_str(), liveValue(r.powerKW, lv));
          emAny = true;
        }
      }
    };
    addEm("em14", em14, lvEm14);
    if (emAny) {
      emOk = Firebase.RTDB.updateNodeSilent(&fbData, "/energy_meters", &j);
      if (!emOk)
        Serial.printf("[Firebase] /energy_meters ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  if (!emAny) {
    led::setMode(led::SLOW_RED);
    return;
  }

  if (emOk) {
    Serial.println("[Firebase] Updated");
    fbOnSuccess();
    ota::noteFbSuccess(); // delivery watchdog-ийн \"амьд\" тэмдэг
    led::setMode(led::OFF);
    led::pulse();
  } else {
    fbOnFailure();
    led::setMode(led::SLOW_RED);
  }

  // OTA heartbeat + self-test gate (амжилттай upload бүрд +1)
  ota::loop(&fbData, emOk);
}
